app/controllers/tasks_controller.rb

  def index
    # @tasks = ['Fold Laundry', 'Sweep Porch', 'Wash Dishes', 'Mow Lawn']
    @tasks = Task.order(:position)
---
SELECT `tasks`.* FROM `tasks` ORDER BY `tasks`.`position` ASC

  def show
    @task = Task.find(params[:id])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = NULL LIMIT 1

  def new
    @count = Task.count
---
SELECT COUNT(*) FROM `tasks`

  def create
    @task = Task.new(task_params)
    if @task.save
---
INSERT INTO `tasks` (`name`, `description`, `position`, `completed`, `created_at`, `updated_at`, `category_id`) VALUES ('Wash Dishes', 'Wash and dry dishes', 3, FALSE, '2024-01-23 23:33:26.487560', '2024-01-23 23:33:26.487560', NULL)

  def edit
    @task = Task.find(params[:id])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1

  def update
    @task = Task.find(params[:id])
    if @task.update(task_params)
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 4 LIMIT 1
UPDATE `tasks` SET `tasks`.`name` = 'Hohoho', `tasks`.`description` = 'HOHOOH', `tasks`.`updated_at` = '2024-01-23 23:54:25.284892' WHERE `tasks`.`id` = 4

  def delete
    @task = Task.find(params[:id])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 4 LIMIT 1

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 4 LIMIT 1
DELETE FROM `tasks` WHERE `tasks`.`id` = 4